from datetime import datetime
from dateutil.relativedelta import relativedelta
from docx import Document
from python_docx_replace import docx_replace, docx_get_keys


parsed_data_1c: dict = {'document_info': {'ВидДокумента': 'Паспорт гражданина РФ', 'ДатаВыдачи': '26.06.2007', 'ДатаРождения': '12.06.1987', 'КемВыдан': 'Отделением по району Коньково ОУФМС России по гор. Москве в ЮЗАО ', 'КодПодразделения': '770-117', 'МестоРождения': 'Москва', 'Номер': '124984', 'Серия': '45 09', 'СрокДокумента': '01.01.0100'}, 'job_info': {'АвансПериод': 25, 'ГрафикРаботы': 'Пятидневная рабочая неделя', 'ДатаПриемаНаРаботу': '02.02.2026', 'Должность': 'Шеф-кондитер', 'ЗарплатаПериод': 10, 'ИспытательныйСрок': 3, 'Оклад': 41795, 'Организация': {'БикБанка': '044525593', 'ДолжностьРуководителя': 'Генеральный директор', 'ИНН_Орг': '9704045967', 'КПП_Орг': '770401001', 'КорСчет': '30101810200000000593', 'НаименованиеПолное': 'Общество с ограниченной ответственностью "МАРУЛА"', 'НаименованиеСокращенное': 'ООО "МАРУЛА"', 'ОГРН(ИП)': '1217700035805', 'РасСчет': '40702810402390007442 в АО «АЛЬФА-БАНК» г. Москва', 'Руководитель': 'Ильягуев Нувах Урилович', 'Телефон': '74951337214', 'ФактическийАдрес': '121059, Москва г, б-р Украинский, д. 15', 'ЮридическийАдрес': '119019, Город Москва, вн.тер.г. муниципальный округ Арбат, ул Арбат, д. 6/2, помещ. 1/1/4'}, 'ОснованиеПодписи': '', 'Отпуск': '28', 'Подразделение': 'Кухня', 'ТкНомер': '5-тр', 'ФИО': 'Молоканов Константин Владимирович'}, 'personal_info': {'ПОЛ': 'Мужской', 'Адрес_проживания': 'РОССИЯ, 117342, Город Москва, вн.тер.г. муниципальный округ Коньково, ул Островитянова, д. 43, к. 1, кв. 113', 'Адрес_прописка': 'РОССИЯ, 117342, Город Москва, вн.тер.г. муниципальный округ Коньково, ул Островитянова, д. 43, к. 1, кв. 113', 'АдресБанка': 'Ул. 2-я Хуторская, д.38А, стр.26', 'Банк': 'АО "ТБанк"', 'БикБанка': '044525974', 'ДатаРождения': '12.06.1987', 'ИНН': '772878576660', 'ИннБанка': '7710140679', 'КоррСчет': '', 'МестоРождения': '0,Москва,,,', 'НомерСчета': '40817810500040378646', 'РасчетныйСчет': '', 'СНИЛС': '135-203-129 07', 'Страна': 'РОССИЯ', 'Телефон': '79250051297', 'ФИО': 'Молоканов Константин Владимирович'}}


def occup_safety_former(input_sample: str, output_result: str, parsed_data_1c: dict) -> str:
    current_date = parsed_data_1c['job_info']['ДатаПриемаНаРаботу']     # 02.02.2026
    date_obj = datetime.strptime(current_date, '%d.%m.%Y')

    new_date_plus_6 = date_obj + relativedelta(months=6)
    new_date_plus_6 = new_date_plus_6.strftime('%d.%m.%Y')

    new_date_plus_12 = date_obj + relativedelta(months=12)
    new_date_plus_12 = new_date_plus_12.strftime('%d.%m.%Y')

    occup_safety_input_words: dict = {
        'Краткое наименование': parsed_data_1c['job_info']['Организация']['НаименованиеСокращенное'],
        'Полное наименование': parsed_data_1c['job_info']['Организация']['НаименованиеПолное'],
        'Дата приказа о приеме': parsed_data_1c['job_info']['ДатаПриемаНаРаботу'],
        'Дата приказа о приеме + 6 месяцев': new_date_plus_6,
        'Дата приказа о приеме + 12 месяцев': new_date_plus_12,
        'Полное имя работника': parsed_data_1c['job_info']['Организация']['НаименованиеПолное'],
        'Дата рождения': parsed_data_1c['document_info']['ДатаРождения'],
        'Должность работника': parsed_data_1c['job_info']['Должность'],
        'Подразделение': parsed_data_1c['job_info']['Подразделение'],
        'Фамилия': parsed_data_1c['personal_info']['ФИО'].split(' ')[0],
        'Инициалы имени, отчества': f'{parsed_data_1c['personal_info']['ФИО'].split(' ')[1][0]} {parsed_data_1c['personal_info']['ФИО'].split(' ')[2][0]}',
        'Руководитель': parsed_data_1c['job_info']['Организация']['Руководитель'],
        'Должность руководителя': parsed_data_1c['job_info']['Организация']['ДолжностьРуководителя'],
        'Пол': parsed_data_1c['personal_info']['ПОЛ'],
        'Имя': parsed_data_1c['personal_info']['ФИО'].split(' ')[1],
        'Отчество': parsed_data_1c['personal_info']['ФИО'].split(' ')[2],
        'Юридический адрес': parsed_data_1c['job_info']['Организация']['ЮридическийАдрес'],
        'Фактический адрес': parsed_data_1c['job_info']['Организация']['ФактическийАдрес'],
        'ИНН организации': parsed_data_1c['job_info']['Организация']['ИНН_Орг'],
        'КПП организации': parsed_data_1c['job_info']['Организация']['КПП_Орг'],
        'ОГРН организации': parsed_data_1c['job_info']['Организация']['ОГРН(ИП)'],
        'Расчетный счет организации': parsed_data_1c['job_info']['Организация']['РасСчет'],
        'БИК банка организации': parsed_data_1c['job_info']['Организация']['БикБанка'],
        'Корреспондентский счет организации': parsed_data_1c['job_info']['Организация']['КорСчет']
    }

    try:
        doc = Document(input_sample)
        keys = docx_get_keys(doc, pattern='<>')
        print(keys)
        docx_replace(doc, '<>', **occup_safety_input_words)

        doc.save(output_result)
        return output_result

    except Exception as e:
        return f'Ошибка во время формирования файла: {e}'


if __name__ == '__main__':
    result: str = occup_safety_former(input_sample='input_sample/ЭДО Стандартные.docx',
                                      output_result='output_result/output_ЭДО Стандартные.docx',
                                      parsed_data_1c=parsed_data_1c)